Public Attributes | List of all members
API_OpeningCutSurfacesParameters Struct Reference
Element Manager API
Cut surface parameters. More...
#include <APIdefs_Elements.h>
 Public Attributes
bool  | useLineOfCutElements
Use lines of cut elements.
short  | linePenIndex
Cut line pen.
API_AttributeIndex  | lineIndex
Cut line index.
Detailed Description
Cut surface parameters.
Member Data Documentation
◆ lineIndex
 API_OpeningCutSurfacesParameters::lineIndex
Cut line index.
◆ linePenIndex
 API_OpeningCutSurfacesParameters::linePenIndex
Cut line pen.
◆ useLineOfCutElements
 API_OpeningCutSurfacesParameters::useLineOfCutElements
Use lines of cut elements.